#### PickSupport Method

---

|  |
| --- |
| SlabShapeEditor Class   See Also |

Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void PickSupport( 	Line gLine ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub PickSupport ( _ 	gLine As Line _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void PickSupport( 	Line^ gLine ) ``` |

#### Parameters

gLine
:   Type:  Autodesk.Revit.DB Line
     A line from a support element such as a beam.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input line is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input line is invalid. |

# See Also

SlabShapeEditor Class

Autodesk.Revit.DB Namespace